import 'package:flutter/material.dart';

void main(List<String> args) {
  runApp(
    MaterialApp(
      home: DefaultTabController(
        length: 3,
        child: Scaffold(
          appBar: AppBar(
            title: Text("Tap"),
            bottom: TabBar(
              tabs: [
                Tab(icon: Icon(Icons.wifi)),
                Tab(icon: Icon(Icons.account_circle_rounded)),
                Tab(icon: Icon(Icons.android)),
              ],
            ),
          ),
          body: TabBarView(
            children: [
              Center(
                child: Column(
                  mainAxisAlignment: MainAxisAlignment.center,
                  children: [
                    Image.network(
                      'https://img.utdstc.com/icon/10f/c30/10fc30d3006913a229234037f518aba005e4b3ccf0a69f6cbeaca247f10b59c1:200',
                    ),
                    SizedBox(height: 150),
                    Text(
                      'เนื้อเรื่องของ Seven Knights Re:BIRTH คือการผจญภัยของกลุ่มตัวละครที่เริ่มต้นจาก อีวาน และ คาริน ที่ออกเดินทางไปในทวีปอาร์เด พร้อมกับปรับโครงสร้างเนื้อเรื่องใหม่ให้เข้าใจง่ายสำหรับผู้เล่นทุกคน และเพิ่มการดำเนินเรื่องให้ผู้เล่นได้สวมบทบาทเป็นตัวเอกเอง นอกจากนี้ยังมีการปรับปรุงเนื้อหาจากภาคแรก เช่น การนำเสนอเรื่องราวของ เอลิเซีย กับ คิริเอล-ไรอัน ให้ดูสมเหตุสมผลมากขึ้น รวมถึงการปรากฏตัวของตัวละครที่คุ้นเคยอย่าง รูดี้, เอเรียล, คารอน และ สนิฟเฟอร์ '
                      'เนื้อเรื่องโดยรวม'
                      'จุดเริ่มต้น: ผู้เล่นจะได้สวมบทบาทเป็นตัวเอกในการเดินทางไปพร้อมกับอีวานและคาริน'
                      'โครงสร้างเนื้อเรื่อง: มีการปรับให้เข้ากับผู้เล่นใหม่ โดยยังคงแกนหลักของเรื่องราวการผจญภัยของกลุ่มอีวานไว้'
                      'การนำเสนอ: ผู้เล่นจะได้พบกับตัวละครที่คุ้นเคยจากภาคแรก และมีการเล่าเรื่องผ่านมุมมองบุคคลที่หนึ่ง'
                      'เนื้อหาเพิ่มเติม: มีการนำเสนอเรื่องราวของตัวละครอย่างเอลิเซียกับคิริเอล-ไรอัน รวมถึงประเด็นความขัดแย้งที่เกิดขึ้นกับ ลูดี้ ซึ่งถูกปรับให้สมเหตุสมผลมากขึ้นการเปลี่ยนแปลงจากภาคแรก'
                      'มุมมองผู้เล่น: เปลี่ยนจากบุคคลที่สามเป็นการสวมบทบาทเป็นตัวเอกในการผจญภัย'
                      'การดำเนินเรื่อง: มีพากย์เสียงประกอบเพื่อให้เนื้อเรื่องสมจริงยิ่งขึ้น'
                      'ความเข้าใจง่าย: ปรับโครงสร้างใหม่เพื่อให้ผู้เล่นที่ไม่เคยเล่นภาคแรกสามารถเข้าใจเนื้อเรื่องได้ทันที',
                    ),
                    SizedBox(height: 10),
                  ],
                ),
              ),
              Center(
                child: Column(
                  mainAxisAlignment: MainAxisAlignment.center,
                  children: [
                    Image.network(
                      'https://img.gamewith.net/img/c62309d2ddf6de807291a87d0ea53f03.png',
                    ),
                    SizedBox(height: 150),
                    Text(
                      'Seven Knights Re:BIRTH มีระบบการเล่นหลักเป็น เกมเพลย์แบบอัตโนมัติและผลัดกันเล่น (Automatic, Turn-Based RPG) โดยผู้เล่นจะต้องวางแผนจัดทีมและลำดับการใช้สกิลอย่างมีกลยุทธ์' 'ก่อนที่จะรับชมการต่อสู้ที่ดำเนินไปอย่างตื่นตาตื่นใจด้วย "ฉากสกิลที่โดดเด่น" และภาพกราฟิกที่สวยงาม เป็นเกมสะสมตัวละครแนวผจญภัยสำหรับมือถือและ PC'
                      'กลไกหลักของเกมเพลย์'
                      'ระบบการต่อสู้แบบผลัดกันเล่นที่ปรับปรุงใหม่: แม้ว่าการต่อสู้จะเป็นแบบผลัดกันเล่น แต่กระบวนการส่วนใหญ่จะเป็นแบบอัตโนมัติ' 'ผู้เล่นจะจัดรูปแบบทีมและกำหนดลำดับสกิล                      จากนั้นรับชมฉากคัตซีนสกิลในขณะที่การต่อสู้ดำเนินไป'
                      'การสะสมและอัปเกรดฮีโร่: เกมมุ่งเน้นไปที่การสะสมและฝึกฝนฮีโร่กว่า 120 ตัว และสัตว์เลี้ยง 30 ตัว ผ่านระบบกาชา'                      'การเพิ่มระดับตัวละครเป็นไปโดยอัตโนมัติเมื่อตัวละครได้รับค่าประสบการณ์จากการเข้าร่วมโหมดเกมต่างๆ โดยมีระดับสูงสุดที่เลเวล 30'
                      'การสร้างทีมเชิงกลยุทธ์: เน้นความสำคัญของการสร้างทีมอย่างมีกลยุทธ์ รวมถึงการทำงานร่วมกันของตัวละคร (เช่น ระบบ Traveler Rebirth System)' 'และการอัปเกรดอุปกรณ์เพื่อรับมือกับความท้าทายต่างๆ เช่น '                     
                      'บอสในโหมดผจญภัย, อารีน่า, และสงครามกิลด์ '
                      'โหมดเกมที่หลากหลาย: ผู้เล่นสามารถมีส่วนร่วมในเนื้อหาที่หลากหลาย ได้แก่:'
                      'โหมดผจญภัย (ดำเนินเรื่องราว)'
                      'อารีน่า (PVP)'
                      'เรด (การต่อสู้กับบอส)'
                      'เนื้อหากิลด์'
                      'ภารกิจประจำวันและกิจกรรมพิเศษ,'
                    ),
                    SizedBox(height: 10),
                  ],
                ),
              ),
              Center(
                child: Column(
                  mainAxisAlignment: MainAxisAlignment.center,
                  children: [
                    Image.network(
                      'https://scontent.fbkk34-3.fna.fbcdn.net/v/t45.1600-4/585537062_2121500015260008_5800821625888461636_n.jpg?stp=cp0_dst-jpg_q75_s526x296_spS444_tt6&_nc_cat=1&ccb=1-7&_nc_sid=c02adf&_nc_eui2=AeF58YAkW842V3Dltxu7T96AwxP0D0n5LRbDE_QPSfktFgW_9v0EoPlEIiJvRAQlD-U8NX1LPIq-G0ni4U81oQNZ&_nc_ohc=pWfP_qEsawIQ7kNvwHgWSVE&_nc_oc=AdnyOn7qlSKqjSHnWK3YTSstxL6qlNRkRYm5zMWgXA_l85jzEGR_gH94Vb5QOzjLuxs&_nc_zt=1&_nc_ht=scontent.fbkk34-3.fna&_nc_gid=8psOgF5uDQOjoGkXOLnaYQ&oh=00_AfgGsqQFQT2dXPTgjMfxV_j3KV_6IjQFqp0wv9ojZSBB7A&oe=692A3C9A',
                    ),
                    SizedBox(height: 150),
                    Text(
                      'เกม Seven Knights Re:BIRTH เปิดตัวในประเทศไทยอย่างเป็นทางการเมื่อวันที่ 18 กันยายน 2568 โดยผู้เล่นสามารถดาวน์โหลดและเล่นได้บนแพลตฟอร์ม PC, iOS และ Android '
                      'เปิดตัวอย่างเป็นทางการ: 18 กันยายน 2568'
                      'แพลตฟอร์ม: PC, iOS และ Android'
                      'การลงทะเบียนล่วงหน้า: เปิดให้ลงทะเบียนล่วงหน้าก่อนวันเปิดตัวเพื่อรับรางวัลพิเศษ'
                      'รายละเอียดเพิ่มเติม: เกมนี้เป็นการนำภาคต้นฉบับมาสร้างใหม่ด้วยกราฟิก 3D และระบบการเล่นแบบเทิร์นเบสที่ดีขึ้น พร้อมเนื้อเรื่องที่ปรับปรุงใหม่',
                    ),
                    SizedBox(height: 10),
                  ],
                ),
              ),
            ],
          ),
        ),
      ),
    ),
  );
}

class Network {}
